# Напишите программу, которая принимает на вход цифру, 
# обозначающую день недели, и проверяет,
# является ли этот день выходным.
# 6 -> да
# 1 -> нет

print ('input N ')
num = int(input ())
if (num == 1):
    print('нет')
if (num == 2):
    print('нет')
if (num == 3):
    print('нет')
if (num == 4):
    print('нет')
if (num == 5):
    print('нет')
if (num == 6):
    print('да')
if (num == 7):
    print('да')